{
    "hair": [
        {
            "name": "Straight",
            "type": "1",
            "photo": "",
            "description": "Straight hair reflects the most sheen. It is also the most resilient hair of all of the hair types. It is hard to damage and next to impossible to curl this hair texture. Because the sebum (natural oil produced in the sebaceous glands of the scalp) gently works its way from the scalp to the ends without the interference of curls or kinks, it is the most oily hair texture of all.",
            "subtype":[]
        },{
            "name": "Wavy",
            "type": "2",
            "photo": "",
            "description": "Wavy hair lies somewhere between straight and curly hair. It also imparts sheen, more than curly hair, but less than straight hair. The further down the wavy spectrum you go the less sheen the hair will impart. Wavy hair is typically more prone to frizz.",
            "subtype":[
                {
                    "name": "Wavy A",
                    "type": "A",
                    "photo": "",
                    "description": "",
                    "products":[],
                    "tutorials":[]
                }, {
                    "name": "Wavy B",
                    "type": "B",
                    "photo": "",
                    "description": "",
                    "products":[],
                    "tutorials":[]
                }, {
                    "name": "Wavy C",
                    "type": "C",
                    "photo": "",
                    "description": "",
                    "products":[],
                    "tutorials":[]
                }
            ]
        },{
            "name": "Curly",
            "type": "3",
            "photo": "",
            "description": "If you pull a strand of a type 3 curly, you will notice it has a definite S shape. Granted, the S may be a lower case s or upper case S, or it may even resemble a Z on some occasions...however, there is a definite curl pattern in place, with our without products. This hair type is full bodied, climate dependent (humidity = frizz), and damage prone. Lack of proper care renders dull curls.",
            "subtype":[
                {
                    "name": "Curly A",
                    "type": "A",
                    "photo": "",
                    "description": "",
                    "products":[],
                    "tutorials":[]
                }, {
                    "name": "Curly B",
                    "type": "B",
                    "photo": "",
                    "description": "",
                    "products":[],
                    "tutorials":[]
                }, {
                    "name": "Curly B",
                    "type": "B",
                    "photo": "",
                    "description": "",
                    "products":[],
                    "tutorials":[]
                }
            ]
        },{
            "name": "Kinky",
            "type": "4",
            "photo": "",
            "description": "Despite many misconceptions, this tightly coiled hair is quite fine and fragile. It is wiry, and delicate by nature. Each strand usually has a zig zag pattern. Kinky hair is the driest hair type, thus it is more prone to breakage and requires a gentle touch. A misconception exists that this hair type does not grow. Kinky hair grows at the same rate as other texture, however, if not treated properly it breaks more than other textures. Treat this hair type like a fine silk blouse – cleanse gently, detangle softly, and avoid harsh chemicals.",
            "subtype":[
                {
                    "name": "Kinky A",
                    "type": "A",
                    "photo": "",
                    "description": "",
                    "products":[],
                    "tutorials":[]
                }, {
                    "name": "Kinky B",
                    "type": "B",
                    "photo": "",
                    "description": "",
                    "products":[],
                    "tutorials":[]
                }, {
                    "name": "Kinky B",
                    "type": "B",
                    "photo": "",
                    "description": "",
                    "products":[],
                    "tutorials":[]
                }
            ]
        }
    ]
}
